# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 with ContMix integration for enhanced feature representation
# ContMix paper: https://arxiv.org/abs/2502.20087

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-contmix.yaml' will call yolov8-contmix.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n-ContMix summary: similar parameters, enhanced features
  s: [0.33, 0.50, 1024] # YOLOv8s-ContMix summary: similar parameters, enhanced features
  m: [0.67, 0.75, 768]  # YOLOv8m-ContMix summary: similar parameters, enhanced features
  l: [1.00, 1.00, 512]  # YOLOv8l-ContMix summary: similar parameters, enhanced features
  x: [1.00, 1.25, 512]  # YOLOv8x-ContMix summary: similar parameters, enhanced features

# YOLOv8-ContMix backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8-ContMix head with ContMix enhancements
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, ContMixC2f, [512, False, 0.5]] # 12 - ContMix enhanced neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, ContMixC2f, [256, False, 0.5]] # 15 (P3/8-small) - ContMix enhanced neck

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, ContMixC2f, [512, False, 0.5]] # 18 (P4/16-medium) - ContMix enhanced neck

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large) - Keep regular C2f for final layer

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)