# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 with CPRAformer integration for enhanced object detection
# Integrates Cross Paradigm Representation and Alignment Transformer at P3/P4 levels
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cpra.yaml' will call this file with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n-CPRA summary: layers TBD, parameters TBD, gradients TBD, GFLOPS TBD
  s: [0.33, 0.50, 1024] # YOLOv8s-CPRA summary: layers TBD, parameters TBD, gradients TBD, GFLOPS TBD
  m: [0.67, 0.75, 768]  # YOLOv8m-CPRA summary: layers TBD, parameters TBD, gradients TBD, GFLOPS TBD
  l: [1.00, 1.00, 512]  # YOLOv8l-CPRA summary: layers TBD, parameters TBD, gradients TBD, GFLOPS TBD
  x: [1.00, 1.25, 512]  # YOLOv8x-CPRA summary: layers TBD, parameters TBD, gradients TBD, GFLOPS TBD

# YOLOv8-CPRAformer backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2 - Keep original C2f for early layers
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, CPRAformerC2f, [256, True]]  # 4 - P3: Replace with CPRAformer
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, CPRAformerC2f, [512, True]]  # 6 - P4: Replace with CPRAformer
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f, [1024, True]]       # 8 - Keep original C2f for deeper layers
  - [-1, 1, SPPF, [1024, 5]]         # 9

# YOLOv8-CPRAformer head (unchanged)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # cat backbone P4
  - [-1, 3, C2f, [512]]              # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # cat backbone P3  
  - [-1, 3, C2f, [256]]              # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]       # cat head P4
  - [-1, 3, C2f, [512]]              # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]        # cat head P5
  - [-1, 3, C2f, [1024]]             # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)